'use strict'
//пример 1 

// оператор инкремента в префиксной форме увеличивает значение А на 1 (что в итоге дает 2) и возвращает результат в С
let a = 1, b = 1, c, d;
c = ++a;
alert(c);
// ответ: 2 

//пример 2 
//оператор инкремента в постфиксной форме увеличивает B на 1 (что в итоге дает 2), но возвращает в D значение B до инкремента, т.е. 1
d = b++;
alert(d);
//ответ: 1 

//пример 3 
//после выполнения примера 1 в значение A записано 2, в примере 3 первой выполняется операция префиксного инкремента, т.е. увеличивает А еще на 1 и дает 3, далее к 2 прибавляется 3
c = 2 + ++a;
alert(c);
//ответ: 5 

//пример 4 
//после выполнения примера 2 в значение B записано 2, в примере 4 первой выполняется операция постфиксного инкремента, которая увеличивает значение B на 1, т.е. B будет равно 3. 
//Но поскольку постфиксный инкремент возвращает значение до инкремента, то в операции сложения будет участвовать его предыдущее значение, равно 2. Т.о. 2 + 2 = 4
d = 2 + b++;
alert(d);
//ответ: 4 

//в примере 3 расписано получение значения А = 3
alert(a);
//3 


//в примере 4 расписано получение значения В = 3
alert(b);
//3