/* 
выведет 2010, т.к.:
1. выполняется операция сложения чисел 10 и 10
2. результат сложения (число 20) складывается со строкой
*/
console.log(10 + 10 + "10");
/* 
выведет 101010, т.к.:
1. выполняется операция сложения чисела 10 и строки "10", для числа 10 осуществляется неявное приведение типа, что дает в результате строку "1010"
2. строка "1010" складывается с числом, после неявного приведения типов получаем строку "101010"
*/
console.log(10 + "10" + 10);
/* 
выведет число 30, т.к.:
1. выполняется операция сложения чисел 10 и 10, что дает 20
2. +"10" приводит строку в число
3. к 20 прибавляется 10 = 30
*/
console.log(10 + 10 + +"10");
/* 
выведет число отрицательную бесконечность, т.к.:
1. осуещствляется приведение пустой строки с отрицательному числу, что дает минус ноль
2. число делиться на минус ноль, что дает отрицальную бесконечность
*/
console.log(10 / -"");
/* 
выведет число отрицательную бесконечность, т.к.:
1. осуещствляется приведение строки "2,5" с числу, что число не дает (т.к. разделитель - запятая)
2. деление числа на строку дает NaN
*/
console.log(10 / +"2,5");